public final class e {
   public static final String[][] a = new String[][]{
      {"拳挑起", "熊咆哮", "暗黑之光", "一闪·破", "耐性", "魔力", "会心", "忍耐"}, {"拳挑起", "熊咆哮", "暗黑之光", "一闪·破", "耐性", "魔力", "会心", "忍耐"}
   };
   public static final String[][] b = new String[][]{
      {
            "奋力的用拳对前方的地面发动猛烈震击，能将敌人挑起在半空中。",
            "聚剑气、拳道于一体发动熊咆哮，震飞附近的所有敌人并造成大量伤害。",
            "聚集全身的剑气发动黑暗攻击，对附近大范围的敌人造成大量伤害。",
            "成功防御敌人攻击，将怒气化形，以极速斩出一剑，造成普通攻击多倍以上伤害。",
            "通过提升自己的力量，强化身体，增加生命最大值和基础攻击力。",
            "通过提升自己的精神力量，增加魔力最大值。",
            "通过提高自己的剑术，增加暴击概率。",
            "通过提升自己的斗气，增加吸收伤害的能力。"
      },
      {"追加连击技", "射出巨大的冰冻之箭，对一条线上的敌人造成冰冻伤害", "向天上射出冰之箭，对自身周围全部敌人造成冰冻伤害"}
   };
   public static final short[] c = new short[]{22, 23, 6, 8, 65, 66, 16, -1, -1, 32, -1, 103};
   public static final byte[][][] d = new byte[][][]{{{12, 16, 13}, {12, 15, 13}, {12, 15, 13}, {12, 16, 13}, {2, 0}, {3}, {9}, {11}}};
   public static final byte[][] e = new byte[][]{{5, 5, 5, 5, 10, 10, 10, 10}};
   private static final short[][][][] i = new short[][][][]{
      {
            {
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 3, 0, 0, 33, 1},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 3, 0, 0, 33, 2},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 3, 0, 0, 33, 3},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 3, 0, 0, 33, 4},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 3, 0, 0, 33, 5}
            },
            {
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 8, 0, 30, 0, 2},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 8, 0, 40, 0, 3},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 8, 0, 50, 0, 3},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 8, 0, 60, 0, 4},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 8, 0, 70, 0, 5}
            },
            {
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 8, 0, 30, 0, 3},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 8, 0, 40, 0, 3},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 8, 0, 50, 0, 3},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 8, 0, 60, 0, 4},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 8, 0, 70, 0, 5}
            },
            {
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 1, 0, 0, 30, 5},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 1, 0, 0, 30, 5},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 1, 0, 0, 30, 5},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 1, 0, 0, 30, 8},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 1, 0, 0, 30, 10}
            },
            {
                  {5, 0, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2},
                  {5, 0, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2},
                  {5, 0, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3},
                  {5, 0, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3},
                  {5, 0, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3},
                  {5, 0, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4},
                  {5, 0, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4},
                  {5, 0, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4},
                  {5, 0, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5},
                  {5, 0, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5}
            },
            {
                  {0, 0, 0, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2},
                  {0, 0, 0, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2},
                  {0, 0, 0, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3},
                  {0, 0, 0, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3},
                  {0, 0, 0, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3},
                  {0, 0, 0, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4},
                  {0, 0, 0, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4},
                  {0, 0, 0, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4},
                  {0, 0, 0, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5},
                  {0, 0, 0, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5}
            },
            {
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 2},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 2},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 3},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 3},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 3},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 4},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 4},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 4},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 5},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 5}
            },
            {
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 2},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 2},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 3},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 3},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 3},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 4},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 4},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 4},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 5},
                  {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 5}
            }
      }
   };
   private byte j = 0;
   public short[][] f = new short[][]{{1, 1, 0}, {1, 1, 1}, {0, 0, 2}, {1, 1, 3}, {0, 0, 4}, {0, 0, 5}, {0, 0, 6}, {0, 0, 7}, {0, 0, 8}, {0, 0, 9}};
   public static final short[][] g = new short[][]{
      {1, 1, 0}, {1, 1, 1}, {0, 0, 2}, {1, 1, 3}, {0, 0, 4}, {0, 0, 5}, {0, 0, 6}, {0, 0, 7}, {0, 0, 8}, {0, 0, 9}
   };
   public short[][][] h = (short[][][])null;

   public e(byte var1) {
      this.b(var1);
   }

   private void b(byte var1) {
      this.h = i[var1];
      this.j = var1;
   }

   public final String a(int var1) {
      String var2 = "";
      if (this.b(var1)) {
         var2 = var2 + "< " + a[this.j][var1] + " >&";
      }

      int var3;
      if ((var3 = this.a(var1, this.c(var1), 17)) > 0) {
         var2 = var2 + "升级需要" + var3 + "个技能点，&";
      }

      if (!this.e(var1)) {
         var2 = var2 + "尚未习得&";
      } else {
         var2 = var2 + "当前级别" + this.c(var1) + "&";
         byte[] var4 = d[this.j][var1];
         int var5 = 0;

         for(int var6 = 0; var6 < var4.length; ++var6) {
            if ((var5 = this.a(var1, var4[var6])) > 0) {
               switch(var4[var6]) {
                  case 0:
                     var2 = var2 + "攻击力+" + var5 + "，&";
                  case 1:
                  case 4:
                  case 5:
                  case 6:
                  case 7:
                  case 8:
                  case 10:
                  case 14:
                  default:
                     break;
                  case 2:
                     var2 = var2 + "生命上限+" + var5 + "，&";
                     break;
                  case 3:
                     var2 = var2 + "魔力上限+" + var5 + "，&";
                     break;
                  case 9:
                     var2 = var2 + "暴击率+" + var5 + "%，&";
                     break;
                  case 11:
                     var2 = var2 + "伤害吸收+" + var5 + "%，&";
                     break;
                  case 12:
                     var2 = var2 + "伤害+" + var5 + "，&";
                     break;
                  case 13:
                     var2 = var2 + "冷却" + var5 + "秒，&";
                     break;
                  case 15:
                     var2 = var2 + "消耗魔力" + var5 + "点，&";
                     break;
                  case 16:
                     var2 = var2 + "消耗一定的怒气，&";
               }
            }
         }
      }

      if (this.d(var1)) {
         var2 = var2 + "已经升至最高级&";
      } else {
         var2 = var2 + "下一级别" + (this.c(var1) + 1) + "&";
         byte[] var9 = d[this.j][var1];
         int var11 = 0;

         for(int var13 = 0; var13 < var9.length; ++var13) {
            if ((var11 = this.a(var1, this.c(var1), var9[var13])) > 0) {
               switch(var9[var13]) {
                  case 0:
                     var2 = var2 + "攻击力+" + var11 + "，&";
                  case 1:
                  case 4:
                  case 5:
                  case 6:
                  case 7:
                  case 8:
                  case 10:
                  case 14:
                  default:
                     break;
                  case 2:
                     var2 = var2 + "生命上限+" + var11 + "，&";
                     break;
                  case 3:
                     var2 = var2 + "魔力上限+" + var11 + "，&";
                     break;
                  case 9:
                     var2 = var2 + "暴击率+" + var11 + "%，&";
                     break;
                  case 11:
                     var2 = var2 + "伤害吸收+" + var11 + "%，&";
                     break;
                  case 12:
                     var2 = var2 + "伤害+" + var11 + "，&";
                     break;
                  case 13:
                     var2 = var2 + "冷却" + var11 + "秒，&";
                     break;
                  case 15:
                     var2 = var2 + "消耗魔力" + var11 + "点，&";
                     break;
                  case 16:
                     var2 = var2 + "消耗一定的怒气，&";
               }
            }
         }
      }

      return var2 + b[this.j][var1];
   }

   public final boolean b(int var1) {
      return true;
   }

   public final int a(byte var1) {
      if (this.d(var1)) {
         return 1;
      } else {
         if (!this.e(var1)) {
            this.f[var1][1] = 1;
            this.f[var1][0] = 0;
         }

         ++this.f[var1][0];
         short var2 = this.f[var1][0];
         if (var1 < 12) {
            int var3 = 0;

            for(int var4 = 0; var4 < 12; ++var4) {
               if ((var3 = this.a(var1, var2, var4)) > 0 && c[var4] >= 0) {
                  av.t.W[c[var4]] += var3;
                  switch(c[var4]) {
                     case 6:
                        av.t.d(var3);
                        break;
                     case 8:
                        av.t.e(var3);
                        break;
                     case 16:
                        av.t.H();
                  }
               }
            }

            av.t.V[22] = (short)av.t.W[32];
         }

         return 0;
      }
   }

   public final void a() {
      for(int var1 = 1; var1 < 9; ++var1) {
         while(this.f[var1][0] > g[var1][0]) {
            int var2 = 0;

            for(int var3 = 0; var3 < 12; ++var3) {
               if ((var2 = this.a(var1, this.f[var1][0], var3)) > 0 && c[var3] >= 0) {
                  av.t.W[c[var3]] -= var2;
                  switch(c[var3]) {
                     case 6:
                        av.t.d(-var2);
                        break;
                     case 8:
                        av.t.e(-var2);
                        break;
                     case 16:
                        av.t.H();
                  }
               }
            }

            --this.f[var1][0];
         }
      }

      av.t.V[22] = (short)av.t.W[32];
      this.h = i[0];
      int var4 = av.t.W[58] + av.t.W[85];
      this.f = g;
      av.t.W[58] = var4;
      av.t.W[85] = 0;
   }

   public final short c(int var1) {
      return this.f[var1][0];
   }

   public final boolean d(int var1) {
      return this.c(var1) >= e[this.j][var1];
   }

   public final boolean e(int var1) {
      return this.f[var1][1] == 1;
   }

   public final int f(int var1) {
      if (var1 >= 4 || var1 < 0) {
         return 30000;
      } else if (this.e(var1)) {
         int var2;
         return (var2 = this.c(var1) - 1) < 0 ? -1 : this.h[var1][var2][15];
      } else {
         return 30000;
      }
   }

   public final int a(int var1, int var2) {
      int var3 = this.c(var1) - 1;
      return this.h[var1][var3][var2];
   }

   public final int a(int var1, int var2, int var3) {
      return var2 >= this.h[var1].length ? 0 : this.h[var1][var2][var3];
   }
}
