import java.io.DataInputStream;
import java.io.DataOutputStream;

public final class t {
   private static n s = null;
   public static final String[][] a = new String[][]{
      {
            "勇者剑",
            "真银剑",
            "霸王剑",
            "镀金剑",
            "降龙剑",
            "闪电剑",
            "氪金圣剑",
            "冒险服",
            "勇士军服",
            "军官铠甲",
            "紫金铠甲",
            "板金铠甲",
            "钢玉铠甲",
            "生命指环",
            "暴击戒指",
            "龙牙镯",
            "紫光链",
            "护心锁",
            "彩虹之心",
            "试练勇者",
            "正式勇者",
            "铁杆勇者",
            "疯狂勇者",
            "变态勇者",
            "连击达人",
            "连击狂人",
            "全能骑士",
            "防御达人",
            "博学者",
            "探索者",
            "杀戮者",
            "可爱的",
            "大富翁",
            "冰冻之王",
            "电神",
            "武器大师",
            "武神"
      },
      new String[0]
   };
   public static final String[][] b = new String[][]{
      {"勇者剑1级 &勇士常用剑。攻击+10", "勇者剑2级 &勇士常用剑。攻击+20", "勇者剑3级 &勇士常用剑。攻击+30"},
      {"真银剑1级 &锋利的真银剑，能提高移动速度。攻击+20，速度+1", "真银剑2级 &锋利的真银剑，能提高移动速度。攻击+40，速度+1", "真银剑3级 &锋利的真银剑，能提高移动速度。攻击+60，速度+2"},
      {"霸王剑1级 &巨大的宽刃剑，攻击有10%概率造成50%额外伤害。攻击+20", "霸王剑2级 &巨大的宽刃剑，攻击有10%概率造成50%额外伤害。攻击+40，", "霸王剑3级 &巨大的宽刃剑，攻击有10%概率造成50%额外伤害。攻击+60"},
      {"镀金剑1级 &神奇的镀金剑，攻击有10%概率造成100%额外伤害。攻击+30", "镀金剑2级 &神奇的镀金剑，攻击有20%概率造成100%额外伤害。攻击+60", "镀金剑3级 &神奇的镀金剑，攻击有30%概率造成100%额外伤害。攻击+90"},
      {"降龙剑1级 &具有降妖除魔的神剑，攻击有10%的概率造成5倍伤害。攻击+40", "降龙剑2级 &具有降妖除魔的神剑，攻击有20%的概率造成5倍伤害。攻击+80", "降龙剑3级 &具有降妖除魔的神剑，攻击有30%的概率造成5倍伤害。攻击+120"},
      {
            "闪电神剑1级 &发掘于勇士岛的神剑，没人知道它的真正来历，使用一闪不消耗怒气，攻击有10%的概率造成10倍伤害。攻击+50",
            "暗黑圣剑2级 &发掘于勇士岛的神剑，没人知道它的真正来历，使用一闪不消耗怒气，攻击有20%的概率造成10倍伤害。攻击+100",
            "暗黑圣剑3级 &发掘于勇士岛的神剑，没人知道它的真正来历，使用一闪不消耗怒气，攻击有30%的概率造成10倍伤害。攻击+150"
      },
      {
            "氪金圣剑1级 &上古之神使用过的圣剑，使用一闪不消耗怒气，10%的概率造成10倍伤害，并无视怪物防御。攻击+60",
            "氪金圣剑2级 &上古之神使用过的圣剑，使用一闪不消耗怒气，20%的概率造成10倍伤害，并无视怪物防御。攻击+120",
            "氪金圣剑3级 &上古之神使用过的圣剑，使用一闪不消耗怒气，30%的概率造成10倍伤害，并无视怪物防御。攻击+180"
      },
      {"冒险服1级 &勇士初期穿戴的防具。防御+2", "冒险服2级 &勇士初期穿戴的防具。防御+4", "冒险服3级 &勇士初期穿戴的防具。防御+6"},
      {"勇士军服1级 &曾经流行在勇士岛的勇士军服。防御+4", "勇士军服2级 &曾经流行在勇士岛的勇士军服。防御+8", "勇士军服3级 &曾经流行在勇士岛的勇士军服。防御+12"},
      {"军官铠甲1级 &勇士岛精英勇士所穿被附魔过的铠甲。防御+6", "军官铠甲2级 &勇士岛精英勇士所穿被附魔过的铠甲。防御+12", "军官铠甲3级 &勇士岛精英勇士所穿被附魔过的铠甲。防御+18"},
      {"紫金铠甲1级 &古代的人类王者所穿的铠甲。防御+8", "紫金铠甲2级 &古代的人类王者所穿的铠甲。防御+16", "紫金铠甲3级 &古代的人类王者所穿的铠甲。防御+24"},
      {"板金铠甲1级 &被战神力量加持的铠甲。防御+10", "板金铠甲2级 &被战神力量加持的铠甲。防御+20", "板金铠甲3级 &被战神力量加持的铠甲。防御+30"},
      {"钢玉铠甲1级 &神秘铠甲，拥有魔神的力量。防御+14", "钢玉铠甲2级 &神秘铠甲，拥有魔神的力量。防御+28", "钢玉铠甲3级 &神秘铠甲，拥有魔神的力量。防御+42"},
      {"生命指环1级 &勇士岛勇士所佩戴的戒指。最大生命值+50", "生命指环2级 &勇士岛勇士所佩戴的戒指。最大生命值+100", "生命指环3级 &勇士岛勇士所佩戴的戒指。最大生命值+150"},
      {"暴击戒指1级 &携带能增加暴击的指环。暴击率+3", "暴击戒指2级 &携带能增加暴击的指环。暴击率+6", "暴击戒指3级 &携带能增加暴击的指环。暴击率+10"},
      {"龙牙镯1级 &龙牙所作的手镯。攻击+10", "龙牙镯2级 &龙牙所作的手镯。攻击+20", "龙牙镯3级 &龙牙所作的手镯。攻击+30"},
      {"紫光链1级 &散发紫色光芒的神奇项链。最大魔法值+50", "紫光链2级 &散发紫色光芒的神奇项链。最大魔法值+100", "紫光链3级 &散发紫色光芒的神奇项链。最大魔法值+150"},
      {"护心锁1级 &黄金打造的护心锁。防御+4", "护心锁2级 &黄金打造的护心锁。防御+8", "护心锁3级 &黄金打造的护心锁。防御+12"},
      {"彩虹之心 &神秘道具，佩戴时使用怒气消耗减半。"},
      {"生命最大值+10，魔法+5"},
      {"生命最大值+50，魔法+25"},
      {"生命最大值+100，魔法+50"},
      {"生命最大值+150，魔法+75"},
      {"生命最大值+200，魔法+100"},
      {"攻击+10"},
      {"攻击+10，移动速度+2"},
      {"攻击+20，暴击+10"},
      {"防御+20"},
      {"生命最大值+300，魔法+200"},
      {"防御+10，移动速度+2"},
      {"攻击+10，暴击+5"},
      {"生命+100，魔法+50"},
      {"生命最大值+200，魔法+100"},
      {"攻击+10，防御+10"},
      {"使用闪电神剑爆破的概率+5%"},
      {"暴击+10"},
      {"暴击+10，移动+2"}
   };
   public static final String[][] c = new String[][]{
      {"勇者剑1级 勇士常用剑。攻击+10", "勇者剑  1级→2级  攻击10→20 & 需要材料 蟹钳10 星光10 海螺壳5 金钱500", "勇者剑  2级→3级  攻击20→30 & 需要材料 蟹钳20 星光20 海螺壳10 金钱500"},
      {"真银剑1级  锋利的真银剑，能提高移动速度。攻击+20，速度+1", "真银剑  1级→2级  攻击20→40 移动1→1 & 需要材料  星光20 海螺壳10 冰晶3 金钱3000", "真银剑  2级→3级  攻击40→60 移动1→2 & 需要材料  星光40 海螺壳20 冰晶5 金钱3000"},
      {
            "霸王剑1级  巨大的宽刃剑，攻击有10%概率造成50%额外的伤害。攻击+30",
            "霸王剑  1级→2级  攻击20→40 爆破率10%→20% & 需要材料  海螺壳20 冰晶3 魔刃1 金钱3000",
            "霸王剑  2级→3级  攻击40→60 爆破率20%→30% & 需要材料  海螺壳40 冰晶5 魔刃3 金钱3000"
      },
      {
            "镀金剑1级  神奇的镀金剑，攻击有10%的概率造成100%的额外伤害。攻击+30",
            "镀金剑  1级→2级  攻击20→40 冰冻率10%→20% & 需要材料  魂石20 魔刃10 蛇胆3 金钱3000",
            "镀金剑  2级→3级  攻击40→60 冰冻率20%→30% & 需要材料  魂石40 魔刃20 蛇胆5 金钱3000"
      },
      {
            "降龙剑1级  具有降妖除魔的神剑，攻击有10%的概率造成5倍伤害。攻击+40",
            "降龙剑  1级→2级  攻击40→80 概率10%→20% & 需要材料  冰晶5 蛇胆5 魔心20 金钱3000",
            "降龙剑  2级→3级  攻击80→120 概率20%→30% & 需要材料  冰晶10 蛇胆10 魔心40 金钱3000"
      },
      {
            "闪电圣剑1级 发掘于勇士岛的神剑，没人知道它的真正来历，使用一闪不消耗怒气，攻击有10%的概率造成10倍伤害。攻击+50",
            "闪电圣剑  1级→2级  攻击50→100 致命一击率10%→20% & 需要材料  金钱30000",
            "闪电圣剑  2级→3级  攻击100→150 致命一击率20%→30% & 需要材料  金钱50000"
      },
      {
            "氪金圣剑1级 上古之神使用过的圣剑，使用一闪不消耗怒气，10%的概率造成10倍伤害，并无视怪物防御。攻击+60",
            "氪金圣剑  1级→2级  攻击60→120 致命一击率10%→20% & 需要材料 冰晶10 刀刃10 魔刃50 魔心50 金钱30000",
            "氪金圣剑  2级→3级  攻击120→180 致命一击率20%→30% & 需要材料 冰晶20 刀刃20 魔刃100 魔心100 金钱30000"
      },
      {"冒险服1级 勇士初期穿戴的防具。防御+2", "冒险服  1级→2级  防御2→4  & 需要材料 星光5 海螺壳5  金钱500", "冒险服  2级→3级  防御4→6  & 需要材料 星光10 海螺壳10  金钱500"},
      {"勇士军服1级 曾经流行在勇士岛的勇士军服。防御+4", "勇士军服  1级→2级  防御4→8  & 需要材料 海螺壳10 蛙心10 魔刃1 金钱1000", "勇士军服  2级→3级  防御8→12  & 需要材料 海螺壳20 蛙心20 魔刃3 金钱1000"},
      {"军官铠甲1级 勇士岛精英勇士所穿被附魔过的铠甲。防御+6", "军官铠甲  1级→2级  防御6→12  & 需要材料 蛙心10 魂石10 刀刃2 金钱2000", "军官铠甲  2级→3级  防御12→18  & 需要材料 蛙心20 魂石20 刀刃3 金钱2000"},
      {"紫金铠甲1级 古代的人类王者所穿的铠甲。防御+8", "紫金铠甲  1级→2级  防御8→16  & 需要材料 魔刃10 海螺壳20 刀刃1 金钱2000", "紫金铠甲  2级→3级  防御16→24  & 需要材料 魔刃20 海螺壳40 刀刃3 金钱2000"},
      {"板金铠甲1级 被战神力量加持的铠甲。防御+10", "板金铠甲  1级→2级  防御10→20  & 需要材料 魔刃20 魂石10 魔心10 金钱3000", "板金铠甲  2级→3级  防御20→30  & 需要材料 魔刃40 魂石20 魔心20 金钱3000"},
      {"钢玉铠甲1级 神秘铠甲，拥有魔神的力量。防御+14", "钢玉铠甲  1级→2级  防御14→28  & 需要材料 冰晶5 蛇胆5 刀刃5 魔刃50 金钱3000", "钢玉铠甲  2级→3级  防御28→42  & 需要材料 冰晶10 蛇胆10 刀刃10 魔刃100 金钱3000"},
      {"生命指环1级 勇士岛勇士所佩戴的戒指。最大生命值+50", "生命指环  1级→2级  最大生命值50→100  & 需要材料 魂石10 刀刃1 金钱500", "生命指环  2级→3级  最大生命值100→150  & 需要材料 魂石20 刀刃3 金钱500"},
      {"暴击戒指1级 携带能增加暴击的戒指。暴击率+3", "暴击戒指  1级→2级  暴击率3→6 & 需要材料 星光10 魔刃3 金钱1000", "暴击戒指  2级→3级  暴击率6→10 & 需要材料 星光20 魔刃5 金钱1000"},
      {"龙牙镯1级 龙牙所作的手镯。攻击+10", "龙牙镯  1级→2级  攻击10→20 & 需要材料 冰晶5 刀刃5 蛇胆5 金钱2000", "龙牙镯  2级→3级  攻击20→30 & 需要材料 冰晶10 刀刃10 蛇胆10 金钱2000"},
      {"紫光链1级 散发紫色光芒的神奇项链。最大魔法值+50", "紫光链  1级→2级  最大魔法值50→100 & 需要材料 海螺壳10 蛙心10 冰晶1 金钱2000", "紫光链  2级→3级  最大魔法值100→150 & 需要材料 海螺壳20 蛙心20 冰晶3 金钱2000"},
      {"护心锁1级 黄金打造的护心锁。最大魔法值+50", "护心锁  1级→2级  最大魔法值50→100 & 需要材料 魔刃10 魂石10 魔心10 金钱2000", "护心锁  2级→3级  最大魔法值100→150 & 需要材料 魔刃20 魂石20 魔心30 金钱2000"},
      {"神秘道具，佩戴时使用怒气消耗减半。"}
   };
   public static final String[] d = new String[]{
      "等级升到4级",
      "等级升到10级",
      "等级升到20级",
      "等级升到30级",
      "等级升到40级",
      "连击最高数达到100",
      "连击最高数达到200",
      "通关王者地下城获得SS级评分",
      "使用防御反击技能累计达到100次",
      "完成20个支线任务",
      "探索所有地图",
      "亲手杀死150只怪物",
      "收集所有的小宠物",
      "通过任务或打怪获得100000金钱",
      "杀死王者级别的万年冰王",
      "获得闪电神剑",
      "获得所有武器",
      "所有技能都修炼为满级"
   };
   public static final short[][][] e = new short[][][]{
      {
            {0, 1, 500, 3, 500, 3, 10, 10, 10, -1, 0, 0, 0, 10, 10, 5, -1, -1, -1, -1, -1, -1, -1, 20, 20, 10, -1, -1, -1, -1, -1, -1, -1},
            {0, 1, 0, 3, 3000, 3, 20, 20, 20, 6, 1, 0, 1, -1, 20, 10, -1, -1, -1, -1, -1, 3, -1, -1, 40, 20, -1, -1, -1, -1, -1, 5, -1},
            {0, 1, 0, 3, 3000, 3, 20, 20, 20, -1, 0, 0, 0, -1, -1, 20, -1, -1, -1, -1, 1, 3, -1, -1, -1, 40, -1, -1, -1, -1, 3, 5, -1},
            {0, 1, 0, 3, 3000, 3, 20, 20, 20, -1, 0, 0, 0, -1, -1, -1, -1, 20, -1, 3, 10, -1, -1, -1, -1, -1, -1, 40, -1, 5, 20, -1, -1},
            {0, 1, 0, 3, 3000, 3, 20, 20, 20, -1, 0, 0, 0, -1, -1, -1, -1, -1, -1, 5, -1, 5, 20, -1, -1, -1, -1, -1, -1, 10, -1, 10, 40},
            {0, 1, 30000, 3, 30000, 3, 50, 50, 50, -1, 0, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {0, 1, 0, 3, 3000, 3, 60, 60, 60, -1, 0, 0, 0, -1, -1, -1, -1, -1, 10, -1, 50, 10, 50, -1, -1, -1, -1, -1, 20, -1, 100, 20, 100},
            {1, 1, 0, 3, 500, 4, 2, 2, 2, -1, 0, 0, 0, -1, 5, 5, -1, -1, -1, -1, -1, -1, -1, -1, 10, 10, -1, -1, -1, -1, -1, -1, -1},
            {1, 1, 2500, 3, 1000, 4, 4, 4, 4, -1, 0, 0, 0, -1, -1, 10, 10, -1, -1, -1, 1, -1, -1, -1, -1, 20, 20, -1, -1, -1, 3, -1, -1},
            {1, 1, 5000, 3, 2000, 4, 6, 6, 6, -1, 0, 0, 0, -1, -1, -1, 10, 10, 2, -1, -1, -1, -1, -1, -1, -1, 20, 20, 3, -1, -1, -1, -1},
            {1, 1, 7500, 3, 2000, 4, 8, 8, 8, -1, 0, 0, 0, -1, -1, 20, -1, -1, 1, -1, 10, -1, -1, -1, -1, 40, -1, 3, -1, 20, -1, -1, -1},
            {1, 1, 10000, 3, 3000, 4, 10, 10, 10, -1, 0, 0, 0, -1, -1, -1, -1, 10, -1, -1, 20, -1, 10, -1, -1, -1, -1, 20, -1, -1, 40, -1, 20},
            {1, 1, 15000, 3, 3000, 4, 14, 14, 14, -1, 0, 0, 0, -1, -1, -1, -1, -1, 5, 5, 50, -1, -1, -1, -1, -1, -1, -1, 10, 10, 100, -1, -1},
            {2, 1, 0, 3, 500, 0, 50, 50, 50, -1, 0, 0, 0, -1, -1, -1, -1, 10, 1, -1, -1, -1, -1, -1, -1, -1, -1, 20, 3, -1, -1, -1, -1},
            {2, 1, 3000, 3, 1000, 5, 3, 3, 4, -1, 0, 0, 0, -1, 10, -1, -1, -1, -1, -1, 3, -1, -1, -1, 20, -1, -1, -1, -1, -1, 5, -1, -1},
            {2, 1, 0, 3, 3000, 5, 5, 5, 10, -1, 0, 0, 0, -1, -1, -1, -1, -1, 5, 5, -1, 5, -1, -1, -1, -1, -1, -1, 10, 10, -1, 10, -1},
            {2, 1, 5000, 3, 2000, 3, 10, 10, 10, -1, 0, 0, 0, -1, -1, 10, 10, -1, -1, -1, -1, 1, -1, -1, -1, 20, 20, -1, -1, -1, -1, 3, -1},
            {2, 1, 5000, 3, 2000, 1, 50, 50, 50, -1, 0, 0, 0, -1, -1, -1, -1, 10, -1, -1, 10, -1, 10, -1, -1, -1, -1, 20, -1, -1, 20, -1, 20},
            {2, 1, 0, 0, 0, 2, 50, 0, 0, -1, 0, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, 0, 10, 0, 0, 1, 5, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, 0, 50, 0, 0, 1, 25, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, 0, 100, 0, 0, 1, 50, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, 0, 150, 0, 0, 1, 75, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, 0, 200, 0, 0, 1, 100, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, 3, 10, 0, 0, -1, 0, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, 3, 10, 0, 0, 6, 2, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, 3, 20, 0, 0, 5, 10, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, 4, 20, 0, 0, -1, 0, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, 0, 300, 0, 0, 1, 200, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, 4, 10, 0, 0, 6, 2, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, 3, 15, 0, 0, 5, 5, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, 0, 50, 0, 0, 1, 50, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, 0, 200, 0, 0, 1, 100, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, 3, 10, 0, 0, 4, 10, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, -1, 0, 0, 0, -1, 0, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, 6, 1, 0, 0, -1, 0, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
            {3, 1, 0, 1, 0, 5, 10, 0, 0, 6, 2, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1}
      }
   };
   public static short[] f = new short[]{1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
   public static final short[] g = new short[]{1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
   public static short[] h = new short[]{0, 0, 0, 0};
   public static final short[] i = new short[]{6, 8, 104, 24, 25, 32, 16};
   public short j;
   public short k = -1;
   public int l = 0;
   public short m = 1;
   public short n = 1;
   public short[] o;
   public String p = null;
   public String q = null;
   public boolean r = false;

   public static final t a(int var0, int var1) {
      if (var1 >= 0 && var1 < e[var0].length) {
         t var2;
         (var2 = new t()).l = var0;
         var2.j = (short)var1;
         var2.k = -1;
         var2.o = new short[33];

         for(int var3 = 0; var3 < e[var0][var1].length; ++var3) {
            var2.o[var3] = e[var0][var1][var3];
         }

         var2.p = a[var0][var1];
         var2.o[1] = f[var2.j];
         var2.m = var2.o[1];
         if (var2.m - 1 >= 0) {
            var2.q = b[var1][var2.m - 1];
         } else {
            var2.q = b[var1][0];
         }

         var2.n = var2.o[0];
         return var2;
      } else {
         System.out.println("error:Equip->ProduceEquip(int id):id is error!");
         return null;
      }
   }

   public static final void a() {
      s.h();
   }

   private t() {
   }

   public final void b(int var1, int var2) {
      if (s == null) {
         s = new n();
      }

      s.c = 58;
      s.d = 0;
      s.e = this.j;
      if (s.d > 20) {
         System.out.println("[Error] :== the actionid is over the maximal num. actionid = " + this.j);
      } else {
         s.b(var1, var2);
      }
   }

   public final void a(short[] var1) {
      this.b(var1[0] + (var1[2] >> 1), var1[1] + (var1[3] >> 1));
   }

   public final void a(DataOutputStream var1) throws Exception {
      o.a(this.o, var1);
      var1.writeShort(this.j);
      var1.writeByte(this.n);
      var1.writeShort(this.m);
      var1.writeShort(this.k);
      var1.writeBoolean(this.r);
      var1.writeShort(f.length);

      for(int var2 = 0; var2 < f.length; ++var2) {
         var1.writeShort(f[var2]);
      }
   }

   public final void a(DataInputStream var1) throws Exception {
      this.o = o.b(var1);
      this.j = var1.readShort();
      this.n = (short)var1.readByte();
      this.m = var1.readShort();
      this.k = var1.readShort();
      this.r = var1.readBoolean();
      short var2 = var1.readShort();

      for(int var3 = 0; var3 < var2; ++var3) {
         f[var3] = var1.readShort();
      }

      this.p = a[this.l][this.j];
      this.q = b[this.j][this.m - 1];
   }

   public final int b() {
      return this.o[2];
   }

   public final boolean c() {
      return this.o[3] > this.m;
   }

   public final int d() {
      if (this.m > this.o[3]) {
         return 1;
      } else {
         ++this.m;
         this.q = b[this.j][this.m - 1];
         f[this.j] = this.m;
         if (av.t.bf[this.n] == this) {
            av.t.W[i[this.o[5]]] -= this.o[6];
            if (this.o[9] >= 0) {
               av.t.W[i[this.o[9]]] -= this.o[10];
            }
         }

         this.o[6] += this.o[6 + this.m - 1];
         if (this.o[9] >= 0) {
            this.o[10] += this.o[10 + this.m - 1];
         }

         if (av.t.bf[this.n] == this) {
            this.b(av.t);
         }

         return 0;
      }
   }

   public final void a(aa var1) {
      var1.b.a(this);
      var1.a(0, this.p + "x1");
   }

   public final void b(aa var1) {
      var1.W[i[this.o[5]]] += this.o[6];
      if (this.o[9] >= 0) {
         var1.W[i[this.o[9]]] += this.o[10];
      }

      this.r = true;
   }

   public final void c(aa var1) {
      var1.W[i[this.o[5]]] -= this.o[6];
      if (this.o[9] >= 0) {
         var1.W[i[this.o[9]]] -= this.o[10];
      }

      this.r = false;
   }

   static {
      String[] var10000 = new String[]{"装备", "首饰", "道具", "称号"};
      (new byte[1][])[0] = new byte[]{7, 6, 6, 6};
      byte[] var0 = new byte[]{11, 12, 13, 14, 15, 16, 17, 18, 19, 20};
      var10000 = new String[]{"生命上限+", "魔力上限+", "怒气消耗减少", "攻击力+", "防御力+", "暴击率+", "移动速度+"};
      int[] var2 = new int[]{16777215, 16629766, 16744448};
      int[] var3 = new int[]{16777215, 4193351, 16385816};
   }
}
